backend/loadTest.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: '/api/auth/signup'
          json:
            username: 'testuser'
            password: '123456'
      - post:
          url: '/api/auth/login'
          json:
            username: 'testuser'
            password: '123456'
          capture:
            - json: '$.token'
              as: 'authToken'
      - get:
          url: '/api/alarms'
          headers:
            Authorization: 'Bearer {{ authToken }}'